Revit 2027 API
Application.NewCurveArrArray Method
Creates an empty array that can store geometric curve loops.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArrArray NewCurveArrArray()
Public Function NewCurveArrArray As CurveArrArray
public:
CurveArrArray^ NewCurveArrArray()
member NewCurveArrArray : unit -> CurveArrArray
Return Value
CurveArrArray
The empty array of curve loops.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace